tylertms/dspic33e-sim/conformance/crc.c
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} CrcConformance;

enum {
    CRC_CONTROL = 0x0640u,
    CRC_CONFIG = 0x0642u,
    CRC_POLYNOMIAL_LOW = 0x0644u,
    CRC_POLYNOMIAL_HIGH = 0x0646u,
    CRC_DATA_LOW = 0x0648u,
    CRC_DATA_HIGH = 0x064au,
    CRC_SHIFT_LOW = 0x064cu,
    CRC_SHIFT_HIGH = 0x064eu,
    CRC_PMD_ADDRESS = 0x0764u,
    CRC_ENABLE = 0x8000u,
    CRC_STOP_IDLE = 0x2000u,
    CRC_FULL = 0x0080u,
    CRC_EMPTY = 0x0040u,
    CRC_INTERRUPT_EMPTY = 0x0020u,
    CRC_GO = 0x0010u,
    CRC_LITTLE_ENDIAN = 0x0008u,
    CRC_PMD = 0x0080u,
    CRC_INTERRUPT_FLAG = 0x0008u,
    CRC_BITS_PER_CYCLE = 2u,
    CRC_IRQ = 67u,
    CRC_VECTOR = 0x0200u,
    CRC_PRIORITY = 3u
};

static void expect(CrcConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[crc-failed] %s\n", name);
    }
}

static uint32_t shift_value(Dspic33* cpu) {
    return (uint32_t)dspic33_read_word(cpu, CRC_SHIFT_LOW) |
           ((uint32_t)dspic33_read_word(cpu, CRC_SHIFT_HIGH) << 16u);
}

static uint8_t valid_words(Dspic33* cpu) {
    return (uint8_t)((dspic33_read_word(cpu, CRC_CONTROL) >> 8u) & 0x1fu);
}

static uint32_t width_mask(uint8_t width) {
    return width == 32u ? UINT32_MAX : ((uint32_t)1u << width) - 1u;
}

static uint32_t reference_crc(const uint32_t* words, uint8_t count, uint8_t data_width,
                              uint8_t polynomial_width, uint32_t polynomial,
                              uint32_t seed, bool little_endian) {
    uint32_t remainder = seed & width_mask(polynomial_width);
    uint32_t taps = (polynomial | 1u) & width_mask(polynomial_width);
    uint8_t word_index;
    for (word_index = 0u; word_index < count; word_index++) {
        uint8_t bit_index;
        for (bit_index = 0u; bit_index < data_width; bit_index++) {
            uint8_t input_index =
                little_endian ? bit_index : (uint8_t)(data_width - bit_index - 1u);
            bool feedback = ((remainder >> (polynomial_width - 1u)) & 1u) != 0u;
            feedback = feedback != ((words[word_index] >> input_index) & 1u);
            remainder = (remainder << 1u) & width_mask(polynomial_width);
            if (feedback) {
                remainder ^= taps;
            }
        }
    }
    return remainder;
}

static bool interrupt_flag(Dspic33* cpu) {
    return (dspic33_read_word(cpu, 0x0808u) & CRC_INTERRUPT_FLAG) != 0u;
}

static void clear_interrupt(Dspic33* cpu) {
    dspic33_write_word(
        cpu, 0x0808u,
        (uint16_t)(dspic33_read_word(cpu, 0x0808u) & ~CRC_INTERRUPT_FLAG));
}

static void configure(Dspic33* cpu, uint8_t data_width, uint8_t polynomial_width,
                      uint32_t polynomial, bool little_endian,
                      bool interrupt_on_empty) {
    uint16_t control = CRC_ENABLE;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(
        cpu, CRC_CONFIG,
        (uint16_t)(((uint16_t)(data_width - 1u) << 8u) | (polynomial_width - 1u)));
    dspic33_write_word(cpu, CRC_POLYNOMIAL_LOW, (uint16_t)polynomial);
    dspic33_write_word(cpu, CRC_POLYNOMIAL_HIGH, (uint16_t)(polynomial >> 16u));
    dspic33_write_word(cpu, CRC_SHIFT_LOW, 0u);
    dspic33_write_word(cpu, CRC_SHIFT_HIGH, 0u);
    if (little_endian) {
        control |= CRC_LITTLE_ENDIAN;
    }
    if (interrupt_on_empty) {
        control |= CRC_INTERRUPT_EMPTY;
    }
    dspic33_write_word(cpu, CRC_CONTROL, control);
}

static void enqueue(Dspic33* cpu, uint8_t data_width, uint32_t value) {
    if (data_width <= 8u) {
        dspic33_write_byte(cpu, CRC_DATA_LOW, (uint8_t)value);
    } else if (data_width <= 16u) {
        dspic33_write_word(cpu, CRC_DATA_LOW, (uint16_t)value);
    } else {
        dspic33_write_word(cpu, CRC_DATA_LOW, (uint16_t)value);
        dspic33_write_word(cpu, CRC_DATA_HIGH, (uint16_t)(value >> 16u));
    }
}

static void start(Dspic33* cpu) {
    dspic33_write_word(cpu, CRC_CONTROL,
                       (uint16_t)(dspic33_read_word(cpu, CRC_CONTROL) | CRC_GO));
}

static void reset_and_access_cases(CrcConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_read_word(cpu, CRC_CONTROL) == CRC_EMPTY, "CRCCON1 reset");
    expect(state, dspic33_read_word(cpu, CRC_CONFIG) == 0u, "CRCCON2 reset");
    expect(state, dspic33_read_word(cpu, CRC_POLYNOMIAL_LOW) == 0u, "CRCXORL reset");
    expect(state, dspic33_read_word(cpu, CRC_POLYNOMIAL_HIGH) == 0u, "CRCXORH reset");
    expect(state, dspic33_read_word(cpu, CRC_DATA_LOW) == 0u, "CRCDATL reset");
    expect(state, dspic33_read_word(cpu, CRC_DATA_HIGH) == 0u, "CRCDATH reset");
    expect(state, shift_value(cpu) == 0u, "CRCWDAT reset");
    expect(state, !cpu->io.crc.active && cpu->io.crc.count == 0u, "CRC runtime reset");

    dspic33_write_word(cpu, CRC_CONTROL, 0xffffu);
    expect(state, dspic33_read_word(cpu, CRC_CONTROL) == 0xa078u,
           "CRCCON1 access mask");
    dspic33_write_word(cpu, CRC_CONTROL, 0u);
    expect(state, dspic33_read_word(cpu, CRC_CONTROL) == CRC_EMPTY,
           "CRC disable resets status");
    dspic33_write_word(cpu, CRC_CONFIG, 0xffffu);
    expect(state, dspic33_read_word(cpu, CRC_CONFIG) == 0x1f1fu, "CRCCON2 access mask");
    dspic33_write_word(cpu, CRC_POLYNOMIAL_LOW, 0xffffu);
    expect(state, dspic33_read_word(cpu, CRC_POLYNOMIAL_LOW) == 0xfffeu,
           "CRCXORL bit zero reserved");
    dspic33_write_word(cpu, CRC_POLYNOMIAL_HIGH, 0xffffu);
    expect(state, dspic33_read_word(cpu, CRC_POLYNOMIAL_HIGH) == 0xffffu,
           "CRCXORH writable");
    dspic33_write_word(cpu, CRC_DATA_LOW, 0xa55au);
    dspic33_write_word(cpu, CRC_DATA_HIGH, 0x5aa5u);
    expect(state,
           dspic33_read_word(cpu, CRC_DATA_LOW) == 0u &&
               dspic33_read_word(cpu, CRC_DATA_HIGH) == 0u,
           "CRCDAT reads zero");
    expect(state, cpu->io.crc.count == 0u, "disabled CRCDAT writes ignored");
}

