tylertms/dspic33e-sim/conformance/crc.c
    configure(cpu, 8u, 16u, 0x1021u, false, true);
    enqueue(cpu, 8u, 0x12u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "empty-select begins word");
    expect(state,
           valid_words(cpu) == 0u && cpu->io.crc.active && interrupt_flag(cpu) &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) != 0u,
           "empty-select interrupts before final shift");
    clear_interrupt(cpu);
    expect(state, dspic33_device_advance(cpu, 3u), "empty-select completes word");
    expect(state,
           !cpu->io.crc.active && !interrupt_flag(cpu) &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) == 0u,
           "empty-select completion does not reinterrupt");

    configure(cpu, 8u, 16u, 0x1021u, false, true);
    enqueue(cpu, 8u, 0x12u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "refill first pop");
    clear_interrupt(cpu);
    enqueue(cpu, 8u, 0x34u);
    expect(state,
           valid_words(cpu) == 1u && cpu->io.crc.active && cpu->events.count == 1u,
           "refill joins active calculation");
    expect(state, dspic33_device_advance(cpu, 4u), "refill word begins");
    expect(state, valid_words(cpu) == 0u && cpu->io.crc.active && interrupt_flag(cpu),
           "refill empty transition reinterrupts");
    clear_interrupt(cpu);
    expect(state, dspic33_device_advance(cpu, 3u), "refill word completes");
    expect(state, !cpu->io.crc.active && !interrupt_flag(cpu),
           "refill completion follows empty-select mode");
}

static void lifecycle_cases(CrcConformance* state, Dspic33* cpu) {
    uint32_t partial;
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    start(cpu);
    expect(state,
           !cpu->io.crc.active && cpu->events.count == 0u &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) != 0u,
           "GO waits for FIFO data");
    enqueue(cpu, 8u, 0x5au);
    expect(state, cpu->io.crc.active && cpu->events.count == 1u,
           "FIFO write starts pending GO");
    expect(state, dspic33_device_advance(cpu, 4u), "pending GO completes");
    expect(state, shift_value(cpu) == 0xfbbfu, "pending GO result");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x12u);
    enqueue(cpu, 8u, 0x34u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "abort begins first word");
    partial = shift_value(cpu);
    dspic33_write_word(cpu, CRC_CONTROL, CRC_ENABLE);
    expect(state,
           !cpu->io.crc.active && valid_words(cpu) == 1u &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) == 0u,
           "GO clear aborts current word and retains FIFO");
    expect(state, dspic33_device_advance(cpu, 8u), "aborted event expires");
    expect(state,
           shift_value(cpu) == partial && valid_words(cpu) == 1u &&
               cpu->events.count == 0u,
           "stale CRC event cannot resume abort");
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 4u), "retained FIFO restarts");
    expect(state, valid_words(cpu) == 0u && !cpu->io.crc.active,
           "restarted CRC completes retained FIFO");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    dspic33_write_word(cpu, CRC_SHIFT_LOW, 0xa5a5u);
    enqueue(cpu, 8u, 0x12u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "seeded calculation begins");
    partial = shift_value(cpu);
    dspic33_write_word(cpu, CRC_SHIFT_LOW, 0xffffu);
    dspic33_write_word(cpu, CRC_SHIFT_HIGH, 0xffffu);
    expect(state, shift_value(cpu) == partial, "active CRCWDAT writes ignored");
    expect(state, dspic33_device_advance(cpu, 3u), "seeded calculation completes");

    configure(cpu, 8u, 16u, 0x1021u, true, true);
    enqueue(cpu, 8u, 0x12u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "disable begins calculation");
    clear_interrupt(cpu);
    dspic33_write_word(cpu, CRC_CONTROL, 0u);
    expect(state,
           dspic33_read_word(cpu, CRC_CONTROL) == CRC_EMPTY && shift_value(cpu) == 0u &&
               valid_words(cpu) == 0u && !cpu->io.crc.active &&
               cpu->io.crc.bits_remaining == 0u,
           "CRCEN clear flushes runtime state");
    expect(state,
           dspic33_read_word(cpu, CRC_CONFIG) == 0x070fu &&
               dspic33_read_word(cpu, CRC_POLYNOMIAL_LOW) == 0x1020u,
           "CRCEN clear preserves configuration");
    expect(state, dspic33_device_advance(cpu, 8u), "disabled stale event expires");
    expect(state, shift_value(cpu) == 0u && !interrupt_flag(cpu),
           "disabled stale event has no effect");
}

static void power_cases(CrcConformance* state, Dspic33* cpu) {
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x5au);
    start(cpu);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state, dspic33_device_advance(cpu, 8u), "advance sleeping CRC");
    expect(state,
           cpu->io.crc.active && cpu->io.crc.count == 1u &&
               cpu->io.crc.bits_remaining == 0u && shift_value(cpu) == 0u &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) != 0u,
           "Sleep suspends CRC state");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    expect(state, dspic33_device_advance(cpu, 4u), "resume sleeping CRC");
    expect(state, shift_value(cpu) == 0xfbbfu && !cpu->io.crc.active,
           "CRC resumes after Sleep");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x5au);
    start(cpu);
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state, dspic33_device_advance(cpu, 4u), "advance active Idle CRC");
    expect(state, shift_value(cpu) == 0xfbbfu && !cpu->io.crc.active,
           "CSIDL clear keeps CRC active in Idle");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    dspic33_write_word(cpu, CRC_CONTROL, (uint16_t)(CRC_ENABLE | CRC_STOP_IDLE));
    enqueue(cpu, 8u, 0x5au);
    start(cpu);
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state, dspic33_device_advance(cpu, 8u), "advance stopped Idle CRC");
    expect(state,
           cpu->io.crc.active && cpu->io.crc.count == 1u &&
               cpu->io.crc.bits_remaining == 0u && shift_value(cpu) == 0u,
           "CSIDL set suspends CRC in Idle");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    expect(state, dspic33_device_advance(cpu, 4u), "resume stopped Idle CRC");
    expect(state, shift_value(cpu) == 0xfbbfu && !cpu->io.crc.active,
           "CRC resumes after stopped Idle");

