tylertms/dspic33e-sim/conformance/crc.c
    configure(cpu, 8u, 16u, 0x1021u, false, true);
    dspic33_write_word(cpu, CRC_CONTROL,
                       (uint16_t)(CRC_ENABLE | CRC_STOP_IDLE | CRC_INTERRUPT_EMPTY));
    enqueue(cpu, 8u, 0x5au);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "raise CRC empty interrupt");
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state, dspic33_device_advance(cpu, 8u), "hold interrupted CRC in Idle");
    expect(state,
           interrupt_flag(cpu) && cpu->io.crc.active &&
               cpu->io.crc.bits_remaining == 6u,
           "pending CRC interrupt passes while clocks stop");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
}

static void pmd_cases(CrcConformance* state, Dspic33* cpu) {
    uint8_t bits_remaining;
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x5au);
    start(cpu);
    dspic33_write_word(cpu, CRC_PMD_ADDRESS, CRC_PMD);
    expect(state, !cpu->io.crc.pmd_disabled, "CRC PMD disable is delayed");
    expect(state, dspic33_device_advance(cpu, 1u) && cpu->io.crc.pmd_disabled,
           "CRC PMD disable applies after one cycle");
    bits_remaining = cpu->io.crc.bits_remaining;
    expect(state,
           cpu->io.crc.active && bits_remaining == 6u &&
               dspic33_read_word(cpu, CRC_CONTROL) == 0u,
           "CRC PMD hides registers after current cycle");
    dspic33_write_word(cpu, CRC_CONFIG, 0xffffu);
    expect(state, dspic33_device_advance(cpu, 8u), "advance PMD-disabled CRC");
    expect(state, cpu->io.crc.active && cpu->io.crc.bits_remaining == bits_remaining,
           "CRC PMD suspends shift state");
    dspic33_write_word(cpu, CRC_PMD_ADDRESS, 0u);
    expect(state, cpu->io.crc.pmd_disabled, "CRC PMD enable is delayed");
    expect(state, dspic33_device_advance(cpu, 1u) && !cpu->io.crc.pmd_disabled,
           "CRC PMD enable applies after one cycle");
    expect(state, dspic33_read_word(cpu, CRC_CONFIG) == 0x070fu,
           "CRC PMD ignores register writes and preserves configuration");
    expect(state, shift_value(cpu) == 0x1021u, "CRC PMD preserves partial remainder");
    expect(state, dspic33_device_advance(cpu, 3u), "finish PMD-resumed CRC");
    expect(state, shift_value(cpu) == 0xfbbfu && !cpu->io.crc.active,
           "CRC completes after PMD resume");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    dspic33_write_word(cpu, CRC_PMD_ADDRESS, CRC_PMD);
    dspic33_write_word(cpu, CRC_PMD_ADDRESS, 0u);
    expect(state, cpu->io.crc.pmd_generation == 2u && cpu->events.count == 2u,
           "rapid CRC PMD toggle queues generations");
    expect(state,
           dspic33_device_advance(cpu, 1u) && !cpu->io.crc.pmd_disabled &&
               (dspic33_read_word(cpu, CRC_PMD_ADDRESS) & CRC_PMD) == 0u,
           "stale CRC PMD event cannot override latest state");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    cpu->device_cycles = UINT64_MAX;
    dspic33_write_word(cpu, CRC_PMD_ADDRESS, CRC_PMD);
    expect(state,
           (dspic33_read_word(cpu, CRC_PMD_ADDRESS) & CRC_PMD) == 0u &&
               cpu->io.crc.pmd_generation == 2u && !cpu->io.crc.pmd_disabled &&
               cpu->events.count == 0u,
           "failed CRC PMD transition rolls back and invalidates generation");
    expect(state, cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR,
           "failed CRC PMD transition reports queue error");
}

static void interrupt_service_cases(CrcConformance* state, Dspic33* cpu) {
    uint16_t priority_address = (uint16_t)(0x0840u + (CRC_IRQ / 4u) * 2u);
    uint16_t priority_shift = (uint16_t)((CRC_IRQ % 4u) * 4u);
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    dspic33_write_word(
        cpu, 0x0828u, (uint16_t)(dspic33_read_word(cpu, 0x0828u) | CRC_INTERRUPT_FLAG));
    dspic33_write_word(cpu, priority_address,
                       (uint16_t)((dspic33_read_word(cpu, priority_address) &
                                   ~(7u << priority_shift)) |
                                  (CRC_PRIORITY << priority_shift)));
    cpu->program[(0x0014u + CRC_IRQ * 2u) / 2u] = CRC_VECTOR;
    cpu->w[15] = 0x1800u;
    enqueue(cpu, 8u, 0x5au);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 4u), "interrupt vector CRC completes");
    expect(state, dspic33_device_interrupt_pending(cpu), "CRC interrupt pending");
    expect(state,
           dspic33_device_service_interrupt(cpu) && cpu->last_interrupt == CRC_IRQ &&
               cpu->pc == CRC_VECTOR,
           "CRC interrupt 67 vectors");
    expect(state,
           dspic33_read_word(cpu, 0x08c8u) ==
               (uint16_t)((CRC_PRIORITY << 8u) | (CRC_IRQ + 8u)),
           "CRC interrupt status identifies vector");
}

static void no_dma_cases(CrcConformance* state, Dspic33* cpu) {
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    dspic33_write_word(cpu, 0x2200u, 0x5aa5u);
    dspic33_write_word(cpu, 0x0b00u, 0u);
    dspic33_write_word(cpu, 0x0b02u, CRC_IRQ);
    dspic33_write_word(cpu, 0x0b04u, 0x2200u);
    dspic33_write_word(cpu, 0x0b06u, 0u);
    dspic33_write_word(cpu, 0x0b0cu, CRC_SHIFT_LOW);
    dspic33_write_word(cpu, 0x0b0eu, 0u);
    dspic33_write_word(cpu, 0x0b00u, 0xa001u);
    enqueue(cpu, 8u, 0x5au);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 4u), "CRC with DMA channel completes");
    expect(state, interrupt_flag(cpu), "CRC completion still raises interrupt");
    expect(state,
           dspic33_read_word(cpu, 0x2200u) == 0x5aa5u && cpu->io.dma_index[0] == 0u &&
               cpu->io.dma_active == 0u && cpu->io.dma_peripheral_pending == 0u,
           "CRC interrupt makes no DMA request");
    expect(state, (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) != 0u,
           "no CRC DMA request leaves one-shot channel enabled");
}

static void copy_reset_failure_cases(CrcConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize CRC copy");
    if (!initialized) {
        return;
    }
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x12u);
    enqueue(cpu, 8u, 0x34u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "copy source begins CRC");
    expect(state, dspic33_copy(&copy, cpu), "copy active CRC");
    expect(state,
           copy.io.crc.active && copy.io.crc.bits_remaining == 6u &&
               copy.io.crc.count == 1u && copy.events.count == 1u,
           "copy retains active CRC state");
    expect(state, copy.events.items != cpu->events.items,
           "copy CRC event storage independent");
    expect(state, dspic33_device_advance(cpu, 7u) && dspic33_device_advance(&copy, 7u),
           "source and copy complete CRC");
    expect(state,
           shift_value(&copy) == shift_value(cpu) &&
               dspic33_read_word(&copy, CRC_CONTROL) ==
                   dspic33_read_word(cpu, CRC_CONTROL),
           "copied CRC result matches source");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    dspic33_write_word(cpu, CRC_PMD_ADDRESS, CRC_PMD);
    expect(state, dspic33_copy(&copy, cpu), "copy pending CRC PMD transition");
    expect(state,
           copy.io.crc.pmd_generation == 1u && !copy.io.crc.pmd_disabled &&
               copy.events.count == 1u && copy.events.items != cpu->events.items,
           "copy retains independent pending CRC PMD state");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_device_advance(&copy, 1u) &&
               cpu->io.crc.pmd_disabled && copy.io.crc.pmd_disabled,
           "copied CRC PMD transitions complete equally");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x12u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "reset begins CRC");
    dspic33_reset(cpu, 0u);
    expect(state,
           dspic33_read_word(cpu, CRC_CONTROL) == CRC_EMPTY && !cpu->io.crc.active &&
               cpu->io.crc.count == 0u && !cpu->io.crc.pmd_disabled &&
               cpu->io.crc.pmd_generation == 0u && cpu->events.count == 0u,
           "POR aborts CRC and clears events");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x12u);
    cpu->device_cycles = UINT64_MAX;
    start(cpu);
    expect(state,
           !cpu->io.crc.active && cpu->events.count == 0u && valid_words(cpu) == 1u &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) == 0u,
           "CRC event overflow aborts without consuming FIFO");
    dspic33_destroy(&copy);
}

int main(void) {
    Dspic33 cpu;
    CrcConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize CRC processor");
    if (initialized) {
        reset_and_access_cases(&state, &cpu);
        fifo_cases(&state, &cpu);
        lane_cases(&state, &cpu);
        known_vector_cases(&state, &cpu);
        width_matrix_cases(&state, &cpu);
        interrupt_timing_cases(&state, &cpu);
        lifecycle_cases(&state, &cpu);
        power_cases(&state, &cpu);
        pmd_cases(&state, &cpu);
        interrupt_service_cases(&state, &cpu);
        no_dma_cases(&state, &cpu);
        copy_reset_failure_cases(&state, &cpu);
        dspic33_destroy(&cpu);
    }
    printf("[crc-summary] cases=%u passed=%u failed=%u\n", state.cases, state.passed,
           state.failed);
    return state.failed == 0u ? 0 : 1;
}
